In [ ]:
! whoami

In [ ]:
! hostname

In [ ]:
! pwd

In [ ]:
! ip addr

In [ ]:
! date

## Install PostgreSQL

In [ ]:
%%capture

# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

## Create User and Database

In [ ]:
# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a database with name `sampledb` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS trainingdb;'
!sudo -u postgres psql -U postgres -c 'CREATE DATABASE trainingdb;'

## Setup Connection

In [ ]:
#To load the sql extention to start using %%sql
%load_ext sql
%sql postgresql://postgres:postgres@localhost/trainingdb
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
%%sql
-- show all database
SELECT schema_name
FROM information_schema.schemata;

## Advanced SQL

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS Employees
(
  EmployeeID int,
  FirstName VARCHAR(30),
  LastName VARCHAR(30),
  ManagerID int
)

In [ ]:
%%sql

INSERT INTO Employees VALUES (1, 'Harper', 'Westbrook', NULL);
INSERT INTO Employees VALUES (2, 'Liam', 'Carrington', 1);
INSERT INTO Employees VALUES (3, 'Evelyn', 'Radcliffe', 1);
INSERT INTO Employees VALUES (4, 'Mason', 'Albright', 2);
INSERT INTO Employees VALUES (5, 'Isla', 'Whitman', 2);
INSERT INTO Employees VALUES (6, 'Noah', 'Sterling', 3);
INSERT INTO Employees VALUES (7, 'Ruby', 'Lennox', 3);
INSERT INTO Employees VALUES (8, 'Caleb', 'Winslow', 5);
INSERT INTO Employees VALUES (9, 'Avery', 'Sinclair', 6);
INSERT INTO Employees VALUES (10, 'Oliver', 'Beckett', 6);

Tampilkan semua data

In [ ]:
%%sql

Salah satu fitur CTE tingkat lanjut yang paling berguna adalah CTE rekursif, yang memungkinkan Anda memecahkan masalah seperti kueri data hierarkis (misalnya, hierarki karyawan organisasi) atau menghasilkan data berurutan seperti kalender.

Kode di bawah ini akan menghasilkan hasil yang berisi informasi tentang seorang karyawan dan manajernya. Dengan menggunakan **self-join**, kita dapat mencocokkan setiap karyawan dengan manajernya berdasarkan MgrID.

In [ ]:
%%sql

WITH RECURSIVE
  cteReports (EmpID, FirstName, LastName, MgrID, EmpLevel)
  AS
  (
    SELECT EmployeeID, FirstName, LastName, ManagerID, 1
    FROM Employees
    WHERE ManagerID IS NULL
    UNION ALL
    SELECT e.EmployeeID, e.FirstName, e.LastName, e.ManagerID,
      r.EmpLevel + 1
    FROM Employees e
      INNER JOIN cteReports r
        ON e.ManagerID = r.EmpID
  )
SELECT
  FirstName || ' ' || LastName AS FullName,
  EmpLevel,
  (SELECT FirstName || ' ' || LastName FROM Employees
    WHERE EmployeeID = cteReports.MgrID) AS Manager
FROM cteReports
ORDER BY EmpLevel, MgrID

### Remove duplicate

In [ ]:
%%sql
INSERT INTO Employees VALUES (2, 'Liam', 'Carrington', 1);
INSERT INTO Employees VALUES (3, 'Evelyn', 'Radcliffe', 1);

In [ ]:
%%sql
-- tampilkan semua record

In [ ]:
%%sql
-- mencari duplikat record
SELECT EmployeeID, COUNT( EmployeeID )
FROM Employees
GROUP BY EmployeeID
HAVING COUNT( EmployeeID )> 1
ORDER BY EmployeeID;

In [ ]:
%%sql
SELECT EmployeeID
FROM (
  SELECT EmployeeID, ROW_NUMBER() OVER( PARTITION BY EmployeeID
        ORDER BY  EmployeeID DESC ) AS row_num
  FROM Employees ) t
WHERE t.row_num > 1

In [ ]:
%%sql
DELETE FROM Employees
WHERE EmployeeID IN
    (SELECT EmployeeID
     FROM (
          SELECT EmployeeID, ROW_NUMBER() OVER( PARTITION BY EmployeeID
          ORDER BY  EmployeeID DESC ) AS row_num
          FROM Employees ) t
    WHERE t.row_num > 1 );

### Memeriksa Nilai yang Ada di Tabel Lain (Klien Aktif)

Saat bekerja dengan data, tugas umum adalah memvalidasi apakah record tertentu ada di tabel lain. Anda mungkin diminta untuk membuat laporan yang hanya menampilkan klien aktif. Untuk mengidentifikasi klien ini, Anda dapat memeriksa apakah CustomerID tertentu ada pada tabel Order.

Dalam kasus seperti itu, perintah EXISTS dapat digunakan untuk menangani persyaratan ini.

In [ ]:
%%sql

CREATE TABLE Customers
(
  CustomerID int,
  FirstName VARCHAR(30),
  LastName VARCHAR(30)
);
INSERT INTO Customers VALUES (1, 'Harper', 'Westbrook');
INSERT INTO Customers VALUES (2, 'Liam', 'Carrington');
INSERT INTO Customers VALUES (3, 'Evelyn', 'Radcliffe');
INSERT INTO Customers VALUES (4, 'Mason', 'Albright');
INSERT INTO Customers VALUES (5, 'Isla', 'Whitman');
INSERT INTO Customers VALUES (6, 'Noah', 'Sterling');
INSERT INTO Customers VALUES (7, 'Ruby', 'Lennox');
INSERT INTO Customers VALUES (8, 'Caleb', 'Winslow');
INSERT INTO Customers VALUES (9, 'Avery', 'Sinclair');
INSERT INTO Customers VALUES (10, 'Oliver', 'Beckett');
INSERT INTO Customers VALUES (11, 'Avery', 'Sinclair');
INSERT INTO Customers VALUES (12, 'Oliver', 'Beckett');

In [ ]:
%%sql

CREATE TABLE orders
(
  OrderID int,
  CustomerID int,
  Quantity int,
  Price decimal(10,2),
  ProductID int
);

INSERT INTO orders VALUES (1,1, 10, 5.2, 1);
INSERT INTO orders VALUES (2,2, 5, 5.2, 1);
INSERT INTO orders VALUES (3,3, 2, 5.2, 1);
INSERT INTO orders VALUES (4,4, 4, 5.2, 1);
INSERT INTO orders VALUES (5,5, 11, 5.2, 1);
INSERT INTO orders VALUES (6,6, 1, 5.2, 1);
INSERT INTO orders VALUES (7,7, 1, 5.2, 1);

In [ ]:
%%sql

SELECT *
FROM Customers a
WHERE
EXISTS (
  SELECT 1 FROM orders b
  WHERE
  a.CustomerID = b.CustomerID
)

### Menemukan Karyawan dengan Gaji Tertinggi

In [ ]:
%%sql

DROP TABLE IF EXISTS Employees;
CREATE TABLE Employees
(
  EmployeeID int,
  Name VARCHAR(30),
  Salary int
);

In [ ]:
%%sql
INSERT INTO Employees VALUES (1, 'John', 5000);
INSERT INTO Employees VALUES (2, 'Jane', 7000);
INSERT INTO Employees VALUES (3, 'Bob', 4500);
INSERT INTO Employees VALUES (4, 'Alice', 9000);
INSERT INTO Employees VALUES (5, 'Mike', 9000);
INSERT INTO Employees VALUES (6, 'Sara', 8000);
INSERT INTO Employees VALUES (7, 'Tom', 6000);
INSERT INTO Employees VALUES (8, 'Lucy', 5500);
INSERT INTO Employees VALUES (9, 'Mary', 5820);
INSERT INTO Employees VALUES (10, 'Tom', 7890);

In [ ]:
%%sql
SELECT a.*
FROM Employees a
ORDER BY Salary desc limit 3

In [ ]:
%%sql
SELECT a.*
FROM Employees a
INNER JOIN (
 SELECT distinct Salary
 FROM Employees
 ORDER BY Salary desc limit 3
) as b
on a.Salary = b.Salary;